tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "yqrashawn/goku"

# Development tools
brew "gh"
brew "lazygit"
brew "neovim"
brew "ripgrep"

# Utilities
brew "fzf"
brew "tealdeer"
brew "tree"
brew "wget"
brew "zoxide"

# Karabiner-Elements config tool
brew "yqrashawn/goku/goku"

# Desktop applications
cask "aerospace"
cask "bluesnooze"
cask "kitty"
cask "notunes"
cask "raycast"
cask "scroll-reverser"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
