tap "yqrashawn/goku"

# Development tools
brew "git"
brew "gh"
brew "delta"
brew "lazygit"
brew "neovim"
brew "node"

# Code search and navigation
brew "fd"
brew "fzf"
brew "ripgrep"

# CLI utilities
brew "bat"
brew "btop"
brew "eza"
brew "jq"
brew "tealdeer"
brew "tree"
brew "wget"
brew "zoxide"

# Other tools
brew "hugo"
brew "speedtest-cli"

# Karabiner-Elements config tool
brew "yqrashawn/goku/goku"

# Window management
cask "aerospace"

# Terminal
cask "kitty"

# Productivity
cask "raycast"

# Utilities
cask "bluesnooze"
cask "calibre"
cask "karabiner-elements"
cask "localsend"
cask "notunes"
cask "qmk-toolbox"
cask "scroll-reverser"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
